""" Целые числа """
# int()
int_num = 10

# float()
float_num = 10.5

# int - неизменяемый тип данных
# num1 = 20
# num1 + 50
# print(num1)
from math import pi
# radius = 5
# s = pi * radius **2
# print(s)
# num1 = 20
# num1 = num1+ 50
# print(num1)

""" Операции для работы с числами """
10 + 10 # сложение - 20 
10 - 5 # вычитание - 5
10 * 5 # сложение - 50
10 / 5 #  деление - 2.0 --> float
10 // 5 # деление с округлением - 2 --> int
3 ** 3 # возведение в степень --> 3 * 3 * 3 --> 27
10 % 3 # выделение остатка --> 1

10 % 2 # 0
10 % 3 # 1

""" Функции для работы с числами """
# round()
# print(round(5.2))
# print(round(5.6))
# print(round(5.5)) # округлит в четную сторону
# print(round(5.87654321, 2)) #округлит до заданных знаков после целого числа

# abs() # показывает насколько далеко от нуля/ абсолютное значение (модуль числа)
# print(abs(5))
# print(abs(-5))
# print(abs(5.6))

# import math 
# math.sqrt(25) # 5

